# Семинар 2

Этот семинар будет посвящен кодстайлу и очень простым задачкам на базовый синтаксис языка.

## Орг вопросы

Напомнить про форму регистрации на курс

## Codestyle 

В курсе мы будем соблюдать [Google codestyle](https://google.github.io/styleguide/cppguide.html)


Пункты, обязательные для упоминания (тут не только codestyle): 

- Правило наименования переменных:
    - Формат (snake_case для локальных переменных)
    - Осмысленность
    - Нужная часть речи

- Объявление переменных в нужных местах (не надо объявлять переменные в самом начале main на весь код)

- Неявные приведения и проблемы с ними

- Дублирование кода = зло

- Магические константы = зло. Кулстори из Quake: https://en.wikipedia.org/wiki/Fast_inverse_square_root

- Функция main должна состоять из нескольких строчек (1-10 +-). Рассказать про разбиение кода на логические блоки (пока только функциями). Можно предложить людям писать функцию Solve

- Всякие примеры плохого кода, тут надеюсь на семинаристов

Через несколько лекций отдельно обсудим пункты про кодстайл в ООП :) 

## Покодить

Порешать контест https://contest.yandex.ru/contest/40236/problems

Сначала общие слова про решение: хочется чтобы студенты решали сами. Ценность не в логике решения, а в чистоте кода и чтобы у всех получилось решить.

Обязательные для разбора задачи:

- Гипотенуза (на арифметику и ввод/вывод)
- Следующее и предыдущие (на работу с выводом красивым)
- Сумма цифр (без циклов и if'ов)
- Следующее четное (без if и с ним)
- Улитка
- Проверка делимости без if'ов
- Максимум двух чисел (вот тут можно функцию написать для решения)

Можно докидывать свои любимые задачи на базовый синтаксис, но пока без массивов. 
